src/main/resources/requestWithDigestAuthXWSS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gss="http://example.com/gssoapservice">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1"
                       xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                       xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-2">
                <wsse:Username>admin</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">b11lDRZNgk+obdBzvxNTJ008YOg=</wsse:Password>
                <wsse:Nonce>t2pZvtndP8afVFS1y+x9QWo9diA=</wsse:Nonce>
                <wsu:Created>2020-07-01T02:56:40.201Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <gss:GetStudentDetailsRequest>
            <gss:id>1</gss:id>
        </gss:GetStudentDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>